import streamlit as st
# 1. ตั้งค่าหัวข้อเว็บ
st.title("ร้านเครื่องเขียนราคา67")
st.write("จัดทำโดย: กลุ่ม5")

st.divider()  # เส้นคั่นหน้าจอ

# 2. แสดงรายการสิ้นค้าชิ้นที่ 1
st.subheader("1. สมุดโน๊ต")
st.write("ราคา : 20บาท")
if st .button("สั่งซื้อสมุดโน๊ต"):
    st.success("บันทึกการสั่งซื้อสมุดโน๊ตเรียบร้อย!!")

st.divider() 

# 3. แสดงรายการสิ้นค้าชิ้นที่ 2
st.subheader("2. ปากกา")
st.write("ราคา : 10บาท")
if st .button("สั่งซื้อปากกา"):
    st.success("บันทึกการสั่งซื้อปากกาเรียบร้อย!!")

st.divider() 

# 4. แสดงรายการสิ้นค้าชิ้นที่ 3
st.subheader("3. ดินสอ")
st.write("ราคา : 7บาท")
if st .button("สั่งซื้อปากกา"):
    st.success("บันทึกการสั่งซื้อปากกาเรียบร้อย!!")
